tutorials/surfaceTracking/interTrackFoam/sloshing2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurfaceShadow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            slip;
    }
    rightWall
    {
        type            slip;
    }
    bottomWall
    {
        type            slip;
    }
    leftWall
    {
        type            slip;
    }
    freeSurface
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
